#include <stdio.h> // підключення бібліотеки
#define N 4 // визначення константи
    int main() // головна функція програми
    {
        int matrix[N][N]; // введення двовимірного масиву для матриці
        int colSums[N] = { 0 }; // введення вектора для збереження сум стовпців
        printf("vvedit matrytsyu:\n"); // виведення тексту для розуміння що робити користувачу
        for (int i = 0; i < N; i++) // цикл для кожного рядка матриці
        {
            for (int j = 0; j < N; j++) // цикл для кожного елемента у рядку
            {
                printf("[%d],[%d]: ", i, j); // виведення позиції елемента
                scanf_s("%d", &matrix[i][j]); // введення елементів
                colSums[j] += matrix[i][j]; // додавання значення до відповідного стовпця
            }
        }
        printf("Suma elementiv stovptsiv:\n"); // виведення тексту (частина відповіді)
        for (int j = 0; j < N; j++) // умова циклу
        {
            printf("Suma stovptsya %d: %d\n", j + 1, colSums[j]); // виведення результатів
        }

        return 0; // завершення програми
    }

