#include <iostream> // підключення бібліотеки

using namespace std; // для бібліотеки iostream

float factorial(int N) // рекурсивна функція для обчислення факторіала
{
    if (N <= 1) // умова при якій функція зупиниться
    {
        return 1; // повернення результату обрахунку
    }
    return N * factorial(N - 1); // обчислення факторіалу
}

float sum(int N, int x) // рекурсивна функція для обчислення суми
{
    if (N < 1) // умова при якій функція зупиниться
    {
        return 0; // повернення результату обрахунку
    }
    return (float)(N * x) / factorial(N + x) + sum(N - 1, x); // обчислення суми
}

int main() // головна функція програми
{
    int N, x; // оголошення змінних типу int
    cout << "Vvedit x: "; // виведення тексту
    cin >> x; // введення x
    cout << "Vvedit N: "; // виведення тексту
    cin >> N; // введення N
    float s = sum(N, x); // обрахунок суми
    cout << "Suma = " << s << endl; // виведення результатів
    return 0; // завершення програми
}
