#include <iostream> // бібліотека для введення, виведення тексту на екран
#include <string>   // бібліотека для роботи з рядками (stod)
#include <cstring>  // бібліотека для роботи з рядками (strlen)

using namespace std; // стандартний простір імен

// головна функція програми
int main(int argc, char* argv[])
{
    // перевірка кількості аргументів
    if (argc != 4)                                          // якщо кількість аргументів не дорівнює 4 (назва програми + 3 параметри)
    {
        cout << "Pomylka! Potribno peredaty 3 arhumenty\n"; // виведення повідомлення про помилку 
        return 1;                                           // завершення програми 
    }

    double a, b;                                            // оголошення змінних для зберігання дійсних чисел
    char oper;                                              // оголошення змінної для зберігання символу математичної операції

    // перевірка чи перші два аргументи є дійсними числами
    try // спробуємо виконати наступний блок коду                                                                    
    {
        a = stod(argv[1]); // дістаємо перше дійсне число та перетворюємо в тип double
        b = stod(argv[2]); // дістаємо друге дійсне число та перетворюємо в тип double
    }
    catch (...) // якщо виникла помилка під час перетворення в double
    {
        cout << "Pomylka! Pershi dva arhumenty povynni buty diysnymy chyslamy\n"; // виведення повідомлення про помилку 
        return 1;                                                                 // завершення програми 
    }

    // перевірка кількості символів у четвертому (argv[3]) аргументі
    if (strlen(argv[3]) != 1) // перевіряємо чи даний аргумент не перевищує один символ
    { 
        cout << "Pomylka! Tretiy arhument povynen buty symvolom operatsiyi (+, -, *, /)\n"; // виведення повідомлення про помилку 
        return 1;                                                                           // завершення програми
    }

    oper = argv[3][0]; // присвоєння першого символу з третього аргументу в змінну oper

    if (oper != '+' && oper != '-' && oper != '*' && oper != '/') // перевірка чи введений символ є допустимим (+, -, *, /)
    {
        cout << "Pomylka! Tretiy arhument povynen buty symvolom operatsiyi (+, -, *, /)\n"; // виведення повідомлення про помилку
        return 1;                                                                           // завершення програми
    }

    // перевірка ділення на нуль
    if (oper == '/' && b == 0)
    {
        cout << "Pomylka! Dilennya na nul\n"; // виведення повідомлення про помилку
        return 1;                             // завершення програми
    } 

    double result;         // ініціалізація змінної, яка зберігатиме результат обчислень
     
    if (oper == '+')       // якщо операція +
    {
        result = a + b;    // додаємо 
    }
    else if (oper == '-')  // якщо операція - 
    {
        result = a - b;    // віднімаємо
    }
    else if (oper == '*')  // якщо операція *
    {
        result = a * b;    // множимо
    }
    else                   // якщо операція /
    {
        result = a / b;    // ділимо
    }

    cout << "Rezultat: " << result << endl; // виведення результату

    return 0;                               // завершення програми
}
