#include <iostream>          // для стандартного введення/виведення
#include "UserInteraction.h" // для функцій виведення меню та інструкції
#include "GameField.h"       // для структури ігрового поля
#include "GameController.h"  // для обробки логіки гри

// головна функція програми
int main()
{
    int running = true;                           // змінна для контролю головного циклу програми

    printInstructions();                          // виводимо правила гри

    while (running)                               // цикл головного меню, працює поки running == true
    {
        printMenu();                              // виводимо текст головного меню на екран

        int userChoice = getMenuChoice();         // отримуємо перевірений вибір користувача (1, 2 або 3)
        
        switch (userChoice)                       // оператор вибору для обробки дій користувача
        {
        case 1:                                   // якщо користувач обрав пункт 1 (почати гру)
        {
            GameController controller;            // створюємо об'єкт контролера гри
            controller.startGame();               // запускаємо основний ігровий процес
            break;                                // виходимо з конструкції switch
        }
        case 2:                                   // якщо користувач обрав пункт 2 (історія ігор)
        {
            showHistory();                        // виклик функції показу історії ігор
            break;                                // виходимо з конструкції switch
        }
        case 3:                                   // якщо користувач обрав пункт 3 (вихід)
        {
            std::cout << "\nUdachi!" << std::endl;// виводимо повідомлення на прощання
            running = false;                      // змінюємо прапорець для зупинки головного циклу
            break;                                // виходимо з конструкції switch
        }
        default:                                  // запобіжник на всякий випадок
        {
            std::cout << "\nNevidoma pomylka menyu!" << std::endl; // виводимо повідомлення про невідому помилку
            break;                                // виходимо з конструкції switch
        }
        }
    }

    return 0;                                     // успішне завершення роботи програми
}