#include<stdio.h> // підключення бібліотеки
#include<math.h> // підключення бібліотеки
#include<locale.h> // підключення бібліотеки
#define N 10 // задання розміру масиву
int main() // головна команда
{  
	int X[N], Y[N], k = 0; // задання змінних
	for (int i = 0; i < N; i++) // цикл для заповнення масиву X
	{
		puts("Vvedit elementy masyvu"); // виведення тексту на екран
		scanf_s("%d", &X[i]); // заповнення масиву
	}
	for (int i = 0; i < N; i++) // цикл для заповнення масиву Y парними значеннями масиву X
	{
		if (X[i] % 2 == 0) // умова парності
		{
			Y[k] = X[i]; // заповнення масиву Y
			k++; // збільшення лічильника на 1
		}
	}
	if (k) // якщо масив Y містить елементи
	{
		puts("Masyv Y z parnykh elementiv masyvu X :"); // виведення тексту на екран
		for (int i = 0; i < k; i++) // цикл для виведення масиву Y
		{
			printf("%d\n", Y[i]); // виведення масиву
		}
	}
	else // якщо перша умова не вірна
	{
		puts("U masyvi X nemaye parnykh elementiv"); // виведення тексту на екран
	}
	return(0); // закінчення програми
}

