#include <iostream>                // підключення бібліотеки для введення/виведення тексту

// функція введення числа з перевіркою, щоб програма не приймала негативні числа
int input()
{
	int N;                         // оголошення змінної, яка зберігатиме введене значення користувачем

	// введення числа
	std::cout << "Enter the number N: ";
	std::cin >> N;

	while (N < 0)                  // якщо введене значення N від'ємне, просимо користувача ввести значення ще раз
	{
		std::cout << "\nError! Number cannot be negative" << std::endl;
		std::cout << "Try again: ";
		std::cin >> N;
	}

	return N;                      // повертаємо введене невід'ємне значення
}

// функція для обрахунку суми чисел від 1 до N
int calculateSum(int N)
{
	int sum = 0;                   // оголошення змінної, яка зберігатиме суму чисел від 1 до N

	for (int i = 1; i <= N; i++)   // цикл для обрахунку суми
	{
		sum += i;                  // обрахунок суми від 1 до N
	}

	return sum;                    // повертаємо обраховану суму
}

// функція для обрахунку добутку чисел від 1 до N
long long calculateProduct(int N)
{
	long long prod = 1;            // оголошення змінної, яка зберігатиме добуток чисел від 1 до N

	for (int i = 1; i <= N; i++)   // цикл для обрахунку добутку
	{
		prod *= i;                 // обрахунок добутку від 1 до N
	}

	return prod;                   // повертаємо обраховане значення добутку
}

// головна функція програми
int main() 
{
	// оголошення змінних
	int N, sum;
	long long prod;

	N = input();                   // виклик функції для введення числа

	sum = calculateSum(N);         // виклик функції для обрахунку суми чисел від 1 до N
	prod = calculateProduct(N);    // виклик функції для обрахунку добутку чисел від 1 до N

	// виведення результатів
	std::cout << "\nThe sum of the numbers from 1 to " << N << " is " << sum << std::endl;
	std::cout << "The product of the numbers from 1 to " << N << " is " << prod << std::endl;

	return 0;                      // завершення програми
}
