t = str(input("Введіть послідовність символів, кількість символів у якій не менше 25: ")) # введення символів

while (len(t) < 25): # перевірка к-сті введених символів. Обрано 25, щоб хоча б якась к-сть символів була між 18 елементом та 3 з кінця
    t = str(input("Помилка, кількість символів повинна бути не менше 25\nСпробуйте знову: ")) # повторне введення

print("Послідовність символів від 18-го символа і до 3-го з кінця (3-й символ з кінця не включається): ", t[17:-3]) # виведення результатів