S = str(input("Введіть речення: ")) # введення речення

while S.strip() == "" or " " not in S: # перевірка чи введено речення
    S = str(input("Помилка, потрібно ввести речення (кілька слів): ")) # повторне введення

W = S.split(' ') # розбиваємо рядок по пробілам

found = 0 # оголошення змінної

for i in W: # цикл по словам
    if i.lower().count('е') == 3: # умова пошук літер 'е'
        print(i) # виводимо слово
        found = 1 # 1 якщо слово знайдено, 0 - навпаки

if (found != 1): # якщо слів з трьома літерами 'е' не знайдено
    print("Немає слів з трьома літерами 'е'") # виведення відповідного повідомлення
