import csv # для роботи з .csv файлами

# відкриття .csv файлу та виведення даних на екран
try: # спробуємо виконати наступний блок коду

    with open("Lab_9.csv", "r") as csvfile: # відкриваємо файл, після роботи закриваємо

        reader = csv.DictReader(csvfile) # зчитуємо дані з відкритого файлу
        print("Country Name: 2015 [YR2015], 2019 [YR2019]") # виведення заголовків

        for row in reader: # цикл по рядкам
            print(row["Country Name"], ":", row["2015 [YR2015]"], ",", row["2019 [YR2019]"]) # виводимо на екран зчитані дані

except Exception as e: # якщо виникла помилка при спробі виконати блок коду try
    print("Виникла помилка: ", e) # виведення повідомлення про помилку

# пошук даних по назвах країн та запис знайдених даних до нового файлу
try: # спробуємо виконати наступний блок коду

    with open("Lab_9.csv", "r") as csvfile: # відкриваємо файл, після роботи закриваємо
        reader = list(csv.DictReader(csvfile)) # зчитуємо дані у список, щоб потім можна було повторно ітерувати

        with open("new_lab_9.csv", "w", newline='') as csvfile2: # відкриваємо (створюємо) файл, після роботи закриваємо

            writer = csv.writer(csvfile2) # записуємо функцію запису даних
            writer.writerow(["Country Name", "2015 [YR2015]", "2019 [YR2019]"]) # записуємо заголовки

            while True: # поки не спрацює break

                country = input("\nВведіть назву шуканої країни: ") # вводимо шукану країну
                while country.isdigit() or country.strip() == "": # якщо назва країни введена не вірно
                    country = input("Введіть назву країни ще раз (повинні бути букви): ") # повторне введення

                found = False # щоб визначити чи знайдено шукану країну

                for row in reader: # цикл по рядкам
                    if row["Country Name"].lower() == country.lower(): # якщо шукану країну знайдено
                        found = True # позначаємо що знайдено
                        print("Знайдено:", row["Country Name"], ":", row["2015 [YR2015]"], ",", row["2019 [YR2019]"]) # виведення повідомлення на екран
                        writer.writerow([row["Country Name"], row["2015 [YR2015]"], row["2019 [YR2019]"]]) # запис знайдених даних у новий файл

                if not found: # якщо не знайдено
                    print("Шуканої назви країни не знайдено!") # виведення відповідного повідомлення

                choice = input("\nБажаєте знайти ще одну країну?\n1 - так\n2 - ні\nВаш вибір: ") # питаємо чи хоче користувач знайти дані про ще одну країну
                while choice not in ("1", "2"): # якщо вибір записано не правильно
                    choice = input("Введіть 1 (так) або 2 (ні): ") # повторне введення

                if choice == "2": # якщо користувач не хоче шукати країни
                    print("\nРоботу завершено. Результати збережено у new_lab_9.csv") # виведення відповідного повідомлення
                    break # завершуємо цикл

except Exception as e: # якщо виникла помилка при спробі виконати блок коду try
    print("Виникла помилка: ", e) # виведення відповідного повідомлення
