#include <stdio.h> // підключення бібліотеки
#define N 4 // визначення константи
int main() // головна функція програми
{
    int matrix[N][N]; // оголошення двовимірного масиву для матриці
    printf("vvedit matrytsyu:\n"); // виведення тексту для розуміння що робити користувачу
    for (int i = 0; i < N; i++) // цикл для кожного рядка матриці
    {
        for (int j = 0; j < N; j++) // цикл для кожного елемента у рядку
        {
            printf("[%d],[%d]: ", i, j); // виведення позиції елемента
            scanf_s("%d", &matrix[i][j]); // введення елементів
        }
    }
    for (int i = 0; i < N; i++) // заміна всіх елементів що діляться на 3
    {
        for (int j = 0; j < N; j++) // умова циклу
        {
            if (matrix[i][j] % 3 == 0) // якщо ділиться на 3 без остачі
            { 
                matrix[i][j] = 3; // заміна елемента на 3
            }
        }
    }
    printf("Zminena matrytsya:\n"); // виведення тексту (частина відповіді)
    for (int i = 0; i < N; i++) // умова циклу
    {
        for (int j = 0; j < N; j++) // умова циклу
        {
            printf("%d ", matrix[i][j]); // виведення елементів матриці
        }
        printf("\n"); // перехід до наступного рядка
    }
    return 0; // завершення програми
}


