#include<stdio.h> // підкючення бібліотеки
int main() 
{
	int i, j, m, n, lich[10]; // введення змінних типу int
	float x[10][10], d; // введення змінних типу float
	puts("Vveidit kilkist ryadkiv (<=10)"); // виведення тексту для розуміння подальших дій користувачу
	scanf_s("%i", &m); // надання можливості користувачу ввести m
	puts("Vveidit kilkist stovptsiv  (<=10)"); // виведення тексту для розуміння подальших дій користувачу
	scanf_s("%i", &n); // надання можливості користувачу ввести n
	puts("Vvedit masyv"); // виведення тексту
	for (i = 0; i < m; i++) // цикл для введення масиву
	{
		for (j = 0; j < n; j++) 
		{
			scanf_s("%f", &x[i][j]); // введення масиву
		}
	}
	puts("Masyv x:"); // виведення тексту
    for (i = 0; i < m; i++) // цикл для виведення масиву
	{
		for (j = 0; j < n; j++) 
		{
			printf("  %8.2f", x[i][j]); // виведення масиву
		}
		printf("\n"); // для початку з нового рядка
	}
	for (i = 0; i < m; i++) // цикл для обнуляння лічильника
	{
		lich[i] = 0;  
	}
	for (i = 0; i < m; i++) // цикл для знаходження добутку додатних елементів для кожного рядка
	{
		d = 1; // надання значеня змінній
		for (j = 0; j < n; j++) // перебираємо спочатку по стовпцям 
		{
			if (x[i][j] > 0) // якщо елемент більше 0
			{
				d *= x[i][j]; // рахуємо добуток
				lich[i]++; // збільшуємо лічильник
			}
		}
		if (lich[i] != 0) // якщо додатні елементи знайдено та добуток пораховано
		{
			printf("Dlya %i ryadka dobutok dodatnikh elementiv = %8.2f\n", i, d); // виведення добутку додатних елементів для кожного рядка
		}
		else // якщо додатні елементи не знайдено
		{
			printf("U %i ryadku nemaye dodatnikh elementiv\n", i); // виведення відповідного повідомлення 
		}
	}
	return(0); // завершення програми
}
