# головна функція програми
def main():
    print("______________ ВВЕДЕННЯ ДАНИХ ______________")

    print("\nКількість підприємств")
    while True: # введення кількості підприємств
        try:    # спробуємо виконати наступний блок коду
            n = int(input("   Введіть кількість підприємств: "))            # користувач вводить кількість підприємств
            if n < 2:                                                       # якщо кількість підприємств менша за 2
                print("   Кількість підприємств має бути більшою за 1!")    # виведення повідомлення про помилку
                continue                                                    # розпочинаємо цикл спочатку
            elif n > 100:                                                   # якщо кількість підприємств більша за 100
                print("   Кількість підприємств має бути меншою за 100!")   # виведення повідомлення про помилку
                continue                                                    # розпочинаємо цикл спочатку
            else:                                                           # якщо все введено правильно
                break                                                       # зупиняємо цикл

        except ValueError:                                                  # якщо виникла помилка при перетворенні на int
            print("   Помилка! Введіть ціле число")                         # виведення повідомлення про помилку
            continue                                                        # розпочинаємо цикл спочатку

    print("\nЗагальна кількість ресурсів")
    while True: # введення загальної кількості ресурсів
        try:    # спробуємо виконати наступний блок коду
            total_invest = int(input("   Введіть загальну кількість ресурсів: ")) # користувач вводить кількість ресурсів
            if total_invest <= 0:                                           # якщо кількість ресурсів менша або дорівнює 0
                print("   Кількість ресурсів має бути більшою за 0!")       # виведення повідомлення про помилку
                continue                                                    # розпочинаємо цикл спочатку
            else:                                                           # якщо все введено правильно
                break                                                       # зупиняємо цикл

        except ValueError:                                                  # якщо виникла помилка при перетворенні на int
            print("   Помилка! Введіть ціле число")                         # виведення повідомлення про помилку
            continue                                                        # розпочинаємо цикл спочатку

    print("\nКрок розподілу ресурсів")
    while True:  # введення кроку розподілу ресурсів
        try:     # спробуємо виконати наступний блок коду
            step = int(input("   Введіть крок розподілу ресурсів: "))       # користувач вводить крок розподілу ресурсів
            if step <= 0:                                                   # якщо крок менший або дорівнює 0
                print("   Крок розподілу ресурсів повинен бути більшим за 0!") # виведення повідомлення про помилку
                continue                                                    # розпочинаємо цикл спочатку
            elif step > total_invest:                                       # якщо крок більший за загальну суму ресурсів
                print("   Крок розподілу ресурсів не повинен бути більшим за загальну кількість ресурсів!") # виведення повідомлення про помилку
                continue                                                    # розпочинаємо цикл спочатку
            else:                                                           # якщо все введено правильно
                break                                                       # зупиняємо цикл

        except ValueError:                                                  # якщо виникла помилка при перетворенні на int
            print("   Помилка! Введіть ціле число")                         # виведення повідомлення про помилку
            continue                                                        # розпочинаємо цикл спочатку

    # створюємо список значень інвестицій від 0 до total_invest з кроком step
    invest_values = list(range(0, total_invest + 1, step))

    # структура для зберігання прибутків (словник, де ключ = сума інвестицій profits[x] = [g1(x), g2(x), g3(x), g4(x)])
    profit = {}

    # автоматично заповнюємо для 0 інвестицій (прибуток 0)
    profit[0] = [0.0] * n

    print("\nВведення прибутків для кожного підприємства", end = "")
    for x in invest_values: # цикл введення даних для кожної інвестиції
        if x == 0:                                       # якщо інвестиції в розмірі 0 ум. од
            continue                                     # переходимо до наступної ітерації циклу

        print(f"\n   Введіть приріст випуску продукції для капіталовкладень обсягом {x} ум. одиниць:")
        row_values = []     # список для зберігання прибутків для кожного підприємства

        for i in range(1, n + 1): # цикл по кожному підприємству
            while True: # цикл триватиме до моменту, коли користувач правильно введе прибуток
                try:    # спробуємо виконати наступний блок коду
                    val_str = input(f"      Підприємство {i}: ")       # вводимо прибуток для і-того підприємства
                    val = float(val_str)                               # перетворюємо з str у float

                    if val < 0:                                        # перевірка на коректність введення
                        print("      Прибуток не може бути від'ємним!")# виведення відповідного повідомлення
                        continue                                       # розпочинаємо цикл спочатку
                    else:                                              # якщо користувач правильно ввів
                        row_values.append(val)                         # додаємо значення до списку
                        break                                          # завершуємо цикл

                except ValueError:                                     # якщо виникла помилка при перетворенні str на float
                    print("      Помилка! Введіть число")              # виведення відповідного повідомлення

        profit[x] = row_values                                         # додаємо введені прибутки до словника

    # виведення таблиці
    print("\nТаблиця введених даних:")

    col_width = 7                               # задаємо ширину колонці
    total_width = (col_width + 1) * (n + 1) + 1 # рахуємо довжину лінії (ширина таблиці)
    horizontal_line = "-" * total_width         # створюємо горизонтальну суцільну лінію

    print(horizontal_line)                      # друкуємо вверх таблиці

    # формування заголовка
    header_row = f"|{'X':^{col_width}}|"          # записуємо х по середині клітинки

    for i in range(1, n + 1):                     # цикл по підприємствах
        header_row += f"{f'g{i}':^{col_width}}|"  # додаємо до заголовку відцентровані клітинки

    print(header_row)                             # друкуємо клітинки
    print(horizontal_line)                        # друкуємо горизонтальну лінію

    # формування рядків з даними
    for x in invest_values:                       # проходимося по кожному інвестиційному значенні
        row_str = f"|{x:^{col_width}}|"           # додаємо значення х та відцентровуємо значення

        for val in profit[x]:                     # цикл по прибутках підприємств для х інвестицій
            row_str += f"{val:^{col_width}.1f}|"  # додаємо g(x) відцентроване посередині

        print(row_str)                            # друкуємо рядок таблиці

    print(horizontal_line)                        # друкуємо горизонтальну лінію

    print("\n__________________ I ЕТАП. УМОВНА ОПТИМІЗАЦІЯ __________________")  # виведення заголовка етапу

    optimal_strategies = {}  # словник для збереження результатів (optimal_strategies[k] = {C: (max_val, best_x)})
    prev_F = {}              # зберігатиме результат попереднього розрахованого кроку

    for k in range(n, 0, -1):  # цикл від останнього підприємства до першого (крок -1)
        print(f"\n{n - k + 1}-й крок: k = {k}")  # виведення номера кроку та поточного підприємства

        current_strategy = {}  # словник для збереження результатів поточного етапу k

        # налаштування вигляду таблиці
        res_col_width = 10  # задаємо ширину колонки для результатів у таблиці

        # рахуємо загальну довжину лінії (ширина таблиці)
        table_width = (col_width + 1) + (res_col_width + 1) * len(invest_values) + (col_width + 1) * 2 + 1

        h_line = "-" * table_width # створюємо горизонтальну суцільну лінію
        print(h_line)              # друкуємо верхню лінію таблиці

        header = f"|{'C \\ X':^{col_width}}|"       # формуємо початок заголовка (перша колонка)

        for x in invest_values:                     # цикл для додавання колонок з можливими x
            header += f"{x:^{res_col_width}}|"      # додаємо x (к-сть інвестицій) до заголовка

        header += f"{f'F{k}(C{k})':^{col_width}}|"  # додаємо колонку максимального прибутку
        header += f"{f'd{k}':^{col_width}}|"        # додаємо колонку оптимального рішення

        print(header)                               # друкуємо сформований заголовок
        print(h_line)                               # друкуємо розділювальну лінію


        for C in invest_values: # перебираємо всі можливі варіанти ресурсів (С = 0, 20, ..., 100)
            row_str = f"|{C:^{col_width}}|" # починаємо формування рядка з значення C

            max_val = -1.0                  # зберігатиме найкращий знайдений прибуток для інвестиції C
            best_x = -1                     # зберігатиме об'єм інвестиції яку треба дати підприємству k, щоб отримати найкраший прибуток

            for x in invest_values: # внутрішній цикл перебору варіантів інвестицій x

                is_valid = True     # прапорець можливості варіанту (спочатку вважаємо, що варіант можливий)

                if x > C: # якщо сума інвестиції більша за наявний ресурс
                    is_valid = False # позначаємо варіант як недопустимий

                if k == n and x != C:  # якщо це останнє підприємство і ми витрачаємо не все C
                    is_valid = False   # позначаємо варіант як недопустимий

                if not is_valid:       # якщо варіант неможливий - ставимо прочерк
                    row_str += f"{'-':^{res_col_width}}|" # додаємо прочерк у рядок
                    continue                              # переходимо до наступної ітерації (наступного x)

                current_profit = profit[x][k - 1] # беремо прибуток поточного k підприємства при х інвестиції

                if k == n: # якщо це останнє підприємство
                    total_profit = current_profit   # повний прибуток дорівнює поточному (бо використовуємо всі кошти)
                    val_str = f"{total_profit:.1f}" # формуємо рядок просто як число

                else: # для всіх інших підприємств
                    remainder = C - x                  # скільки грошей залишиться наступним підприємствам
                    prev_profit = prev_F[remainder][0] # беремо прибуток від наступного підприємства з попереднього кроку
                    total_profit = current_profit + prev_profit # обраховуємо повний прибуток

                    val_str = f"{current_profit:.1f}+{prev_profit:.1f}" # формуємо рядок у форматі суми

                row_str += f"{val_str:^{res_col_width}}|" # додаємо відформатоване значення у рядок таблиці

                if total_profit >= max_val: # якщо поточний прибуток більший або рівний максимальному
                    max_val = total_profit  # запам'ятовуємо новий найбільший прибуток
                    best_x = x              # зберігаємо к-сть інвестицій для k-того підприємства яку треба дати, щоб отримати найкраший прибуток

            # дописуємо результати в кінець рядка
            row_str += f"{max_val:^{col_width}.1f}|" # додаємо значення для колонки максимального прибутку
            row_str += f"{best_x:^{col_width}}|"     # додаємо значення для колонки оптимального рішення
            print(row_str)                           # виводимо готовий рядок таблиці на екран

            current_strategy[C] = (max_val, best_x)  # запам'ятовуємо найкращий прибуток та рішення для ресурсу C у словник

        print(h_line)  # друкуємо нижню лінію таблиці

        # оновлюємо дані для наступного кроку
        prev_F = current_strategy                 # поточна стратегія стає попередньою для наступного кроку циклу
        optimal_strategies[k] = current_strategy  # зберігаємо повну стратегію етапу в загальний словник

    print("\n___________________ II ЕТАП. БЕЗУМОВНА ОПТИМІЗАЦІЯ ___________________")  # виведення заголовка другого етапу

    max_total_profit = optimal_strategies[1][total_invest][0] # знаходимо глобальний максимум прибутку (з результатів 1-го підприємства)

    remaining_cash = total_invest  # змінна для відстеження залишку грошей (починаємо з повної суми)
    final_plan_x = []              # список для збереження фінального плану

    for k in range(1, n + 1): # проходимо по кожному підприємству
        best_invest = optimal_strategies[k][remaining_cash][1]  # дістаємо к-сть інвестицій для k-того підприємства яку треба дати, щоб отримати найкраший прибуток
        current_profit = profit[best_invest][k - 1]             # знаходимо конкретний прибуток для цього підприємства

        print(f"Підприємство {k}: виділяємо {best_invest} ум. од. ресурсів, отримуємо {current_profit:.1f} од. товару") # виводимо інформацію про розподіл для поточного підприємства
        remaining_cash -= best_invest # зменшуємо доступний бюджет на витрачену суму

    print(f"\nЗагальний приріст випуску продукції: {max_total_profit:.2f} ум. од. продукції") # виводимо максимальний дохід

main() # виклик головної функції програми


