def average_neg():
    S = list(map(int, input("Введіть елементи списку через пробіл: ").split())) # введення списку
    # виведення введеного списку
    print("Початковий список:")
    print(S)

    neg = [x for x in S if x < 0] # формування списку з від'ємних елементів

    if len(neg) == 0: # якщо у списку немає від'ємних елементів
        print("У списку немає від'ємних елементів")
        return None
    # обчислення середнього арифметичного та вивід результатів
    avg = sum(neg) / len(neg)
    print(f"Від'ємні елементи: {neg}")
    print(f"Середнє арифметичне від'ємних елементів: {avg}")
    return avg

average_neg()