N = 7 # к-сть рядків та стовпців у масиві

A = [[0] * N for i in range(N)] # створюємо та заповнюємо масив нулями

for i in range (N): # цикл по рядкам
    A[i][i] = N  # елементи головної діагональні = N
    for j in range (N): # цикл по стовпцям
        if i < j: # елементи що знаходяться вище головної діагоналі
            A[i][j] = A[i][j - 1] - 1 # зменшуємо на 1 від попереднього елемента зліва
        elif i > j: # елементи що знаходяться нище головної діагоналі
            A[i][j] = A[i - 1][j] - 1 # зменшуємо на 1 від попереднього елемента зверху

# виводимо сформований масив
for i in range(N):
    for j in range (N):
        print(A[i][j], end=" ")
    print("")

