N = int(input("Введіть кількість елементів у масиві: "))

while N < 1: # перевірка на правильність вводу
    N = int(input("Помилка при введенні кількості елементів у масиві, спробуйте знову: "))

print(f"\nВведіть масив із {N} елементів:")
arr = [int(input(f"arr[{i + 1}] = ")) for i in range(N)] # введення масиву

print("\nВведений масив: ", arr) # виведення масиву

sum_ = 0

print("\nДодатні елементи масиву, які кратні 3:", end=" ")
for i in range (N):
    if arr[i] > 0 and arr[i] % 3 == 0: # умова пошуку
        print(arr[i], end=", ") # виведення знайдених елементів
        sum_ += arr[i] # обчислення суми

print("\nСума додатніх  елементів масиву, кратних трьом =", sum_)
