def del_el(S, el): # функція для видалення елемента зі списку
    if el in S: # перевіряємо, чи є такий елемент у списку
        S.remove(el) # видаляємо перше входження елемента
        print("Елемент", el, "успішно видалено")
    else: # повідомлення про помилку
        print("Елемента", el, "немає у списку")
    return S # повертаємо оновлений список

S = list(map(int, input("Введіть елементи списку через пробіл: ").split())) # введення списку
# виведення введеного списку
print("Початковий список:")
print(S)
# введення елемента, який необхідно видалити
el = int(input("Введіть елемент, який потрібно видалити: "))
# видаляємо перше входження елемента
S = del_el(S, el)
# виведення оновленого списку
print("Оновлений список:")
print(S)
