#include <stdio.h> // підключення бібліотеки
#include <string.h> // підключення бібліотеки
#include <ctype.h> // підключення бібліотеки
int main()
{
	char str[100], * ptr; // введення змінних типу char
	int n, lich1 = 0, lich2 = 0; // введення змінних типу int
	puts("Vvedit rechennya:"); // виведення тексту для розуміння наступних дій користувачу
	fgets(str, 100, stdin); // введення речення
	puts("Vvedit shukanu dovzhynu slova:"); // виведення тексту для розуміння наступних дій користувачу
	scanf_s("%d", &n); // введення шуканої кількості букв у слові
	for (ptr = str; *ptr != '\0'; ptr++) // цикл для пошуку кількості слів, що мають довжину n
	{
		if (!isspace(*ptr)) // якщо символ не є пробілом
		{
			lich1++; // лічильник збільшується 
		}
		else // якщо умова вище не виконалася (символ є пробілом)
		{ 
			if (lich1 == n) // якщо кількість букв у слові = заданому n
			{
				lich2++; // збільшуємо другий лічильник
			}
			lich1 = 0; // скидаємо лічильник букв після кожного слова
		}
	}
	printf("Kilkist sliv, shcho mayut dovzhynu %d bukv = %d", n, lich2); // виведення результату
	return(0); // завершення програми
}