#include<stdio.h> // підкючення бібліотеки
int main()
{
	int i, j, m, n; // введення змінних типу int
	float a[10][10], x[10], b[10] = { 0 }; // введення змінних типу float
	puts("Vveidit kilkist ryadkiv"); // виведення тексту для розуміння подальших дій користувачу
	scanf_s("%i", &m); // надання можливості користувачу ввести m
	puts("Vveidit kilkist stovptsiv"); // виведення тексту для розуміння подальших дій користувачу
	scanf_s("%i", &n); // надання можливості користувачу ввести n
	puts("Vvedit masyv A"); // виведення тексту
	for (i = 0; i < m; i++) // цикл для введення масиву A
	{
		for (j = 0; j < n; j++)
		{
			scanf_s("%f", &a[i][j]); // введення масиву A
		}
	}
	puts("Masyv A:"); // виведення тексту
	for (i = 0; i < m; i++) // цикл для виведення масиву A
	{
		for (j = 0; j < n; j++)
		{
			printf("  %8.2f", a[i][j]); // виведення масиву A
		}
		printf("\n"); // для початку з нового рядка
	}
	puts("Vvedit masyv X"); // виведення тексту
	for (i = 0; i < n; i++) // цикл для введення масиву X
	{
		scanf_s("%f", &x[i]); // введення масиву X
	}
	puts("Masyv X:");
	for (i = 0; i < n; i++) // цикл для виведення масиву X
	{
		printf("  %8.2f", x[i]); // виведення масиву X
	}
	printf("\n"); // для початку з нового рядка
	puts("Masyv B:"); // виведення тексту
	for (i = 0; i < m; i++) // цикл для обчислення масиву B та його виведення 
	{
		for (j = 0; j < n; j++)
		{
			b[i] += a[i][j] * x[j]; // обчислення масиву B
		}
		printf("  %8.2f", b[i]); // виведення масиву B
	}
	return(0); // завершення програми
}