#include <stdio.h> // підключення бібліотеки
#include <math.h> // підключення бібліотеки
int main()
{
    int i, n = 10; // введення змінних типу int
    float x[10], lnn; // введення змінних типу float
    float* p, * pmin; // введення покажчиків типу float
    printf("Vvedit odnovymirnyy masyv z %d chysel\n", n); // виведення тексту для розуміння подальших дій користувачу
    for (i = 0; i < n; i++) // цикл для введення масиву
    {
        scanf_s("%f", &x[i]); // введення масиву
    }
    printf("Vash masyv z %d elementiv:\n", n); // виведення тексту
    for (i = 0; i < n; i++) // цикл для виведення масиву
    {
        printf("%6.2f", x[i]); // виведення масиву
    }
    printf("\n"); // наступний рядок почнеться з нового рядка
    pmin = NULL; // покажчик pmin = адресі NULL, тобто адреса відсутня (невідома)
    for (p = x; p < x + n; p++) // цикл для знаходження мінімального додатнього елемента масиву
    {
        if ((*p > 0) && (pmin == NULL || *p < *pmin)) // якщо елемент масиву (*p) > 0 та значення pmin невідоме або елемент масиву (*p) < за елемент масиву (*pmin) то pmin = адресі елемента масиву (p)
        {
            pmin = p; // pmin = адресі певного елемента масиву
        }
    }
    printf("Minimalnyy dodatniy element masyvu = %.2f\n", *pmin); // виведення мінімального додатнього елемента масиву
    lnn = log(*pmin); // обчислення натурального логарифма з мінімального додатнього елемента масиву
    printf("Naturalnyy loharyfm minimalnoho dodatnoho elementa masyvu = %.2f\n", lnn); // виведення результату з натурального логарифму
    return(0); // завершення програми
}
