#include<stdio.h> // підключення бібліотеки
int main() // головна функція програми
{
int x, i, Prime = 1; // введення змінних
    printf("Enter a number:\n"); // виведення тексту
    scanf_s("%d", &x); // надання можливості вписати число для подальшого аналізу
    for (i = 2; i <= x / 2; ++i) // опис циклу
	{
        if (x % i == 0) // умова, якщо x ділиться на i без остачі
		{
			Prime = 0; // хибне твердження
			break; // закінчення програми
		}
	}
	if (Prime) // якщо число просте
	{
		printf("%d is a prime number.", x); // виведення тексту
	}
	else // якщо число не просте
	{
		printf("%d is not a prime number.", x); // виведення тексту
	}
	return 0; // завершення програми
}


