#include<stdio.h> // підключення бібліотеки
#include<math.h> // підключення бібліотеки
#define N 10 // задання розміру масиву
int main() // головна команда
{
	int X[N], Y[N], k = 0; // задання змінних
	for (int i = 0; i < N; i++) // цикл для заповнення масиву
	{
		puts("Vvedit elementy masyvu"); // виведення тексту на екран
		scanf_s("%d", &X[i]); // заповнення масиву
	}
	for (int i = 0; i < N; i++) // цикл для зсуву масиву праворуч
	{
		Y[k] = X[i - 1]; // зсув праворуч
		k++; // лічильник
	}
	Y[0] = X[N-1]; // переміщення останнього елемента на перше місце
	puts("Zsunutyy vektor:"); // виведення тексту на екран
	for (int i = 0; i < k; i++) // цикл для виведення зсунутого масиву 
	{
		printf("%d\n", Y[i]); // виведення зсунутого масиву
	}
	return(0); // закінчення програми
}
