#include<stdio.h> // підключення бібліотек
#include<math.h>
int main() // головна функція 
{
	double a, b, x; // задання змінних
	puts("The value of a, b"); // виведення тексту на екран
	scanf_s("%lf%lf", &a, &b); // надання можливості вписати значення a, b
	if (a >= b) // якщо a більше або дорівнює b
	{
		x = pow(sin(sqrt(a - b)), 3); // функція для x
		printf("x=%lf\n", x); // виведення результату обчислення
	}
	else // якщо a менше b
	{
		if (a >= 0 && b > 0) // додаткова умова ОДЗ
		{
			x = sqrt(a) + log(b); // функція для x
			printf("x=%lf\n", x); // виведення результату обчислення
		}
		else // якщо ОДЗ не здовільняє
		{
			printf("It is impossible to calculate x at:\n"); // виведення повідомлення про помилку
			printf("a=%lf\n", a); // виведення значення a
			printf("b=%lf\n", b); // виведення значення b
		}
        
	}
	return 0; //завершення програми
}
