# Початок програми. Питання для другого студента від Левадного Якова.
try: # спробуємо виконати наступний блок коду
    with open("Laba_8.txt", "w", encoding="utf-8") as f1: # виконуємо з файлом певні дії та закриваємо його
        # запис інформації до файлу
        f1.write("Студент: Левадний Яків\n")

        f1.write("Питання: Що робить менеджер контексту with у Python "
                 "при роботі з файлами?\n")

except Exception as e: # якщо виникла помилка при спробі виконати блок коду try
    print("Виникла помилка: ", e)

else: # якщо блок коду try успішно виконано
    print("Файл Laba_8.txt створено")

# Відповідь студента Тахтай Назарій. Задано питання до наступного студента
try: # спробуємо виконати наступний блок коду
    with open("Laba_8.txt", "a", encoding="utf-8") as f1: # виконуємо з файлом певні дії та закриваємо його
        # запис інформації до файлу
        f1.write("\nСтудент: Тахтай Назарій\n")

        f1.write("Відповідь: with сам відкриває файл і автоматично "
                 "закриває його після завершення блоку, навіть якщо "
                 "виникне помилка. Тому він безпечніший за open() + close().\n")

        f1.write("Питання: Як прочитати текстовий файл і порахувати кількість слів "
                 "у ньому?\n")

except Exception as e: # якщо виникла помилка при спробі виконати блок коду try
    print("Виникла помилка: ", e)

else: # якщо блок коду try успішно виконано
    print("Файл Laba_8.txt оновлено")

# Відповідь студента Нестеренка Олександра. Задано питання до наступного студента
try: # спробуємо виконати наступний блок коду
    with open("Laba_8.txt", "a", encoding="utf-8") as f1: # виконуємо з файлом певні дії та закриваємо його
        # запис інформації до файлу
        f1.write("\nСтудент: Нестеренко Олександр\n")

        f1.write("Відповідь: Можна відкрити файл через "
                 "with open(назва_файла, r (для читання)), прочитати "
                 "текст, розбити його на слова методом split() і "
                 "порахувати кількість слів функцією len().\n")

        f1.write("Питання: Чим відрізняється режим a від w при відкритті файлу?\n")

except Exception as e: # якщо виникла помилка при спробі виконати блок коду try
    print("Виникла помилка: ", e)

else: # якщо блок коду try успішно виконано
    print("Файл Laba_8.txt оновлено")

# Відповідь студента Орехова Івана.
try: # спробуємо виконати наступний блок коду
    with open("Laba_8.txt", "a", encoding="utf-8") as f1: # виконуємо з файлом певні дії та закриваємо його
        # запис інформації до файлу
        f1.write("\nСтудент: Орехов Іван\n")

        f1.write("Відповідь: w перезаписує файл, а a додає текст "
                 "у кінець без видалення старих даних.\n")

except Exception as e: # якщо виникла помилка при спробі виконати блок коду try
    print("Виникла помилка: ", e)

else: # якщо блок коду try успішно виконано
    print("Файл Laba_8.txt оновлено")
