#include <stdio.h> // підключення бібліотеки
#define N 8 // визначення константи, що задає розмір масиву
int main() // головна функція
{ 
    int array[N]; // введення розміру масиву  
    printf("Vvedit chysla:\n"); // текст для подальшого введення елементів масиву
    for (int i = 0; i < N; i++) // цикл для введення масиву
    { 
        scanf_s("%d", &array[i]);
    }
    printf("Parni elementy obnuleni:\n"); // виведення тексту
    for (int i = 0; i < N; i++) // цикл for
    {
        if (array[i] % 2 == 0) // якщо елемент масиву ділиться на два без остачі
        {
            array[i] = 0; // обнуляння парного значення 
        }
        printf("%d, ", array[i]); // виведення масиву з парними значеннями які = 0
    }
    return 0;
}
