#include <stdio.h> // Підключення бібліотеки
int main() // Головна функція програми
{
	float C, F, c, f; // Задання змінних з плаваючою комою
	printf("Temperature in Celsius \n"); // Вивід тексту на екран
	scanf_s("%f", &c); //Надання можливості вписувати температуру в Цельсіях для переведення в Фаренгейти
	printf("Temperature in Fahrenheit \n"); // Вивід тексту на екран
	scanf_s("%f", &f); //Надання можливості вписувати температуру в Фаренгейтах для переведення в Цельсії
	C = (f - 32) * 5 / 9; //Формула для переведення градусів з Фаренгейта в Цельсія
	printf("The result of converting Fahrenheit to Celsius %f\n", C); // Виведення переведення градусів з Фаренгейта в Цельсія
	F = c * 9 / 5 + 32; // Формула для переведення градусів з Цельсія в Фаренгейта
	printf("The result of converting Celsius to Fahrenheit %f\n", F); // Виведення переведення градусів з Цельсія в Фаренгейта
	return 0; // Завершення програми
}