#include <stdio.h> // підключення бібліотеки
#include <stdlib.h> // підключення бібліотеки для використання бібліотеки (динамічна пам'ять)
int main() // головна функція програми
{
    int M, N; // введення змінних для розміру матриці
    printf("Vvedit rozmiry matrytsi M i N:\n"); // виведення тексту
    scanf_s("%d %d", &M, &N); // надання користувачу можливості ввести розмір матриці
    int** matrix = (int**)malloc(M * sizeof(int*)); // виділення пам'яті для рядків
    for (int i = 0; i < M; i++) 
    {
        matrix[i] = (int*)malloc(N * sizeof(int)); // виділення пам'яті для стовпців
    }
    int num = 1; // лічильник для заповнення матриці
    for (int i = 0; i < M; i++) { // цикл по рядках
        if (i % 2 == 0) { // якщо номер рядка парний (зліва направо)
            for (int j = 0; j < N; j++) // умова циклу
            {
                matrix[i][j] = num++; // формула
            }
        }
        else // якщо номер рядка непарний (справа наліво)
        { 
            for (int j = N - 1; j >= 0; j--) 
            {
                matrix[i][j] = num++; // формула
            }
        }
    }
    printf("Matrytsya zapovnena zmiikoyu:\n");  // виведення заповненої матриці
    for (int i = 0; i < M; i++) // умова циклу
    {
        for (int j = 0; j < N; j++) // умова циклу
        {
            printf("%4d", matrix[i][j]); // виведення елемента матриці з вирівнюванням
        }
        printf("\n"); // перехід до наступного рядка
    }
    for (int i = 0; i < M; i++) // звільнення виділеної пам'яті
    {
        free(matrix[i]); // звільнення пам'яті для кожного рядка
    }
    free(matrix); // звільнення пам'яті для масиву вказівників

    return 0; // завершення програми
}


