#include <stdio.h> // підключення бібліотеки
#define N 8 // визначення константи, що задає розмір масиву
int main() // головна функція
{
    int array[N]; // введення розміру масиву  
    int sum = 0; // введення змінної
    printf("Vvedit chysla:\n"); // текст для подальшого введення елементів масиву
    for (int i = 0; i < N; i++) // цикл для введення масиву
    { 
        scanf_s("%d", &array[i]);
    }
    for (int i = 0; i < N; i++) // введення циклу
    {
        sum += array[i]; // формула для sum
    }
    printf("Suma masyvu = %d\n", sum); // виведення результату обчислення 
    return 0; // завершення програми
}

