#include<stdio.h> // підкючення бібліотеки
int main() 
{
	int i, j, m, n; // введення змінних типу int
	float A[10][10], B[10][10], min = 0; // введення змінних типу float
	puts("Vveidit kilkist ryadkiv matrytsyu (<=10)"); // виведення тексту для розуміння подальших дій користувачу
	scanf_s("%i", &m); // надання можливості користувачу ввести m
	puts("Vveidit kilkist stovptsiv matrytsyu (<=10)"); // виведення тексту для розуміння подальших дій користувачу
	scanf_s("%i", &n); // надання можливості користувачу ввести n
	puts("Vvedit matrytsyu"); // виведення тексту
	for (i = 0; i < m; i++) // цикл для введення матриці
	{
		for (j = 0; j < n; j++)
		{
			scanf_s("%f", &A[i][j]); // введення матриці
		}
	}
	puts("Zadana matrytsya:"); // виведення тексту
	for (i = 0; i < m; i++) // цикл для виведення матриці
	{
		for (j = 0; j < n; j++)
		{
			printf("%8.2f", A[i][j]); // виведення матриці
		}
		printf("\n"); // для початку з нового рядка
	}
	min = A[0][0]; // ініціалізуємо min
	for (i = 0; i < m; i++) // цикл для пошуку мінімального значення масиву A
	{
		for (j = 0; j < n; j++)
		{
			if (min > A[i][j]) // умова для пошуку мінімального значення
			{
				min = A[i][j]; // мінімальне значення
			}
		}
	}
	printf("Minimalnyy element matrytsi A = %.2f\n", min); // виведення мінімального значення матриці A
	puts("Matrytsya B:"); // виведення тексту
	for (i = 0; i < m; i++) // цикл для виведення матриці B, кожний елемент
    // якої являє собою цілу частину відповідного елемента матриці А[М×N] 
	// поділеного на її мінімальний елемент
	{
		for (j = 0; j < n; j++)
		{
			B[i][j] = A[i][j] / min; // обчислення матриці B
			printf("%8.0f", B[i][j]); // виведення матриці B
		}
		printf("\n"); // для початку з нового рядка
	}
	return(0); // завершення програми
}