#include <stdio.h> // Підключення бібліотеки
#include <Windows.h> // Підключення бібліотеки
#include <math.h> // Підключення бібліотеки
#include <locale.h>
#define N 10 // Встановлення розміру масиву
int main() { // Головна функція програми
	setlocale(LC_ALL, "ukr");
	SetConsoleOutputCP(1251); // Кодування Windows-1251
	SetConsoleCP(1251); // Кодування Windows-1251
	int MAS[N], i, coup = 0, sum = 0, odd = 0, prod = 1, max = -100, max_id; // Оголошення змінних
		float av, avg; // Оголошення змінної 
	for (i = 0; i < N; i++) { // Оператор циклу for
		printf("Введіть число MAS[%d]=", i); // Виведення тексту на екран 
		scanf_s("%d", &MAS[i]); // Введення значень елементів масиву
	}
	for (i = 0; i < N; i++) { // Оператор циклу for
		if (MAS[i] % 2 == 0) { // Умовний оператор if
			sum += MAS[i]; // Сума всіх парних чисел 
			coup++; // К-сть всіх парних чисел
		}
	}
	for (i = 0; i < N; i++) { // Оператор циклу for
		if (MAS[i] % 2 != 0) { // Умовний оператор if
			prod *= MAS[i]; // Добуток непарних елементів
			odd++; // К-сть всіх непарних чисел
		}
	}
	if (odd) { // Умовний оператор if
		avg = pow((float)prod, 1.0 / odd); // Обчислення середнього геометричного непарних елементів масиву
			printf("Середнє геометричне непарних елементів масиву: %f\n", avg); // Виведення тексту на екран
			printf("Добуток непарних елементів масиву: %d\n", prod); // Виведення тексту на екран
	}
	else
		puts("У масиві немає жодного непарного числа\n"); // Виведення тексту на екран 
	if (coup) { // Умовний оператор if
		av = (float)sum / coup; // Обчислення середнього арифметичного парних елементів масиву
			printf("Середнє арифметичне парних елементів масиву: %f\n", av); //Виведення тексту на екран
			printf("Сума парних елементів масиву: %d\n", sum); // Виведення тексту на екран 
	}
	else
		puts("У масиві немає жодного парного числа\n"); // Виведення тексту на екран 
	for (i = 0; i < N; i++) { // Оператор циклу for
		if (max < MAS[i]) { // Умовний оператор if
			max = MAS[i]; // Максимальне значення у масиві
			max_id = i; // Порядковий номер максимального значення 
		}
	}
	printf("Максимальне значення елементу [%d]: %d\n", max_id, max); // Виведення тексту на екран
		return 0; // Завершення програми
}