#pragma once

#define MIN_FIELD_SIZE 3      // мінімальний розмір ігрового поля
#define MAX_FIELD_SIZE 9      // максимальний розмір ігрового поля

struct GameField              // структура для зберігання стану ігрового поля
{
    int** playField;          // двовимірний масив для зберігання ігрового поля
    int sizeField;            // введений користувачем розмір ігрового поля
    int emptyRow;             // індекс рядка порожньої клітинки
    int emptyCol;             // індекс колонки порожньої клітинки
};

// виділення пам'яті для playField та заповнення масиву фішками в довільному порядку
void createGameField();

// звільнення виділеної динамічної пам'яті
void deleteGameField();