a = 0 # перший елемент ряду фібоначі
b = 1 # другий елемент ряду фібоначі
count = 0 # лічильник

print("i-член", "", "Значення") # виведення заголовків таблиці

for i in range (1, 26, 1): # цикл для обчислення та виведення ряду фібоначі

    if i >= 5: # умова після виконання якої почнеться виведення ряду фібоначі та обчислення к-сті елементів
        count += 1 # збільшуємо лічильник
        if i < 10: # для рівного виведення
            print(i, " " * 5, a) # виведення і-того елемента ряду
        else: # для рівного виведення
            print(i, " " * 4, a) # виведення і-того елемента ряду

    temp = a # оголошення нової змінної якій надаємо значення а
    a = b # a = наступному елементу ряду
    b = temp + b # обраховуємо новий елемент ряду

print("Кількість елементів: ", count) # виведення кількості елементів
