a = float(input("Введіть a (додатнє): ")) # введення а

while (a < 1): # якщо а введенно не вірно
    print("ПОМИЛКА: а повинно бути додатним") # повідомлення про помилку
    a = float(input("Введіть a: ")) # вводимо а знову

b = float(input("Введіть b (додатнє): ")) # введення b

while (b < 1): # якщо b введенно не вірно
    print("ПОМИЛКА: b повинно бути додатним") # повідомлення про помилку
    b = float(input("Введіть b: ")) # вводимо b знову

if (a > b): # перша умова
    X = a * b + 21 # обчислення

elif (a == b): # друга умова
    X = -5 # обчислення

else: # якщо дві попередні умови не виконалися
    X = (3 * a) / b + 1 # обчислення

print("Результат обчислення виразу: ", X) # виведення результатів обчислень
