import pandas as pd # підключення модуля pandas

# заданий словник
students = \
    {
    "Нестеренко Олександр Олександрович":
    {
        "адреса": "вул. Шевченка, 10",
        "номер школи": 3,
        "клас": 8,
        "середній бал": 10.8,
        "кількість пропусків": 2
    },
    "Остапенко Вадим Миколайович":
    {
        "адреса": "вул. Миру, 8",
        "номер школи": 5,
        "клас": 10,
        "середній бал": 9.4,
        "кількість пропусків": 5
    },
    "Орехов Іван Васильович":
    {
        "адреса": "вул. Центральна, 13",
        "номер школи": 4,
        "клас": 9,
        "середній бал": 8.7,
        "кількість пропусків": 3
    },
    "Ганжара Богдан Сергійович":
    {
        "адреса": "вул. Грушевського, 58",
        "номер школи": 5,
        "клас": 11,
        "середній бал": 11.2,
        "кількість пропусків": 1
    },
    "Пушкар Юлія Сергіївна":
    {
        "адреса": "вул. Перемоги, 31",
        "номер школи": 3,
        "клас": 10,
        "середній бал": 10.1,
        "кількість пропусків": 0
    },
    "Тахтай Назар Володимирович":
    {
        "адреса": "вул. Квіткова, 4",
        "номер школи": 4,
        "клас": 11,
        "середній бал": 9.9,
        "кількість пропусків": 4
    },
    "Писала Ольга Володимирівна":
    {
        "адреса": "вул. Лесі Українки, 19",
        "номер школи": 4,
        "клас": 8,
        "середній бал": 11.0,
        "кількість пропусків": 1
    },
    "Снаговська Дар'я Сергіївна":
    {
        "адреса": "вул. Степана Бандери, 21",
        "номер школи": 3,
        "клас": 11,
        "середній бал": 8.9,
        "кількість пропусків": 7
    },
    "Левадний Яків Валентинович":
    {
        "адреса": "вул. Шевченка, 44",
        "номер школи": 5,
        "клас": 7,
        "середній бал": 9.1,
        "кількість пропусків": 3
    },
    "Горбась Володимир Володимирович":
    {
        "адреса": "вул. Грушевського, 13",
        "номер школи": 4,
        "клас": 10,
        "середній бал": 10.3,
        "кількість пропусків": 2
    }
}

# виведення словника
print("\nПочатковий словник:",)
for pib, data in students.items(): # цикл для красивого виведення словника
    print(f"\n{pib}:\nАдреса: {data['адреса']};\nНомер школи: {data['номер школи']};")
    print(f"Клас: {data['клас']};\nСередній бал: {data['середній бал']};")
    print(f"Кількість пропусків: {data['кількість пропусків']}.")

# перетворимо словник в DataFrame та виведемо створений датафрейм
df = pd.DataFrame.from_dict(students, orient="index") # перетворення словника в DataFrame
pd.set_option("display.max_columns", None) # для того щоб показувало всі колонки DataFrame при виведенні
pd.set_option("display.width", None) # щоб розтягнути таблицю по всій ширині терміналу
print("\nПеретворимо словник у DataFrame:\n", df) # виведення створеного DataFrame

# виведемо перші три рядки
print("\nПерші 3 рядки:")
print(df.head(3)) # повертає та друкує перші 3 рядки

# перевіримо типи даних
print("\nПеревіримо типи даних:")
print(df.dtypes) # показує тип даних у кожному стовпці DataFrame

# визначимо кількість рядків і стовпців
print("\nВизначимо кількість рядків і стовпців")
print(df.shape) # друкуємо кількість рядків та стовпців

# отримаємо описову статистику
desc_stats = df.describe() # отримуємо та зберігаємо описову статистику
rounding_format = {col: 0 for col in desc_stats.columns} # створюємо словник де ключ - назва стовпця, значення - 0 (всі стовпці округлюємо до 0 знаків після коми)
rounding_format['середній бал'] = 2 # за ключем 'середній бал' змінюємо значення на 2 (2 знаки після коми)
desc_stats_rounded = desc_stats.round(rounding_format) # застосовуємо округлення за встановленим правилом
int_cols = ['номер школи', 'клас', 'кількість пропусків'] # створюємо список назв стовпців, які хочемо перетворити на int
desc_stats_rounded[int_cols] = desc_stats_rounded[int_cols].astype(int) # для обраних стовпців змінюємо float на int
print("\nОтримаємо описову статистику:")
print(desc_stats_rounded) # виведення результатів

# додамо новий стовпець - рейтинг учня (середній бал * (12 - к-сть пропусків))
df["рейтинг учня"] = df["середній бал"] * (12 - df["кількість пропусків"]) # створення нового стовпця
print("\nDataFrame з новим стовпцем 'рейтинг учня':")
print(df) # виведення оновленого DataFrame

# виконаємо фільтрацію даних (виведемо учнів із середнім балом > 10)
print("\nУчні з середнім балом > 10:")
print(df[df["середній бал"] > 10]) # виведення відфільтрованого DataFrame

# сортування даних за спаданням середнього балу
print("\nВідсортований DataFrame по спаданню середнього балу:")
print(df.sort_values(by="середній бал", ascending=False)) # сортування та виведення DataFrame

# групування даних та знаходження середнього балу по школах
print("\nЗгрупований DataFrame по школах з обрахованим середнім балом:")
print(df.groupby("номер школи")["середній бал"].mean().reset_index())

# додаткові операції агрегаціїІ
# максимальний рейтинг у кожній школі
print("\nМаксимальний рейтинг у кожній школі:")
print(df.groupby("номер школи")["рейтинг учня"].max().reset_index())

# кількість унікальних класів
print("\nКількість унікальних класів:")
print(df["клас"].nunique())
