# функція додавання учня до словника
def add_dict(students, pib, address, school_number, clas):
    students[pib] = \
    {
        "адреса": address,
        "номер школи": school_number,
        "клас": clas
    }

# функція видалення учня із словника
def delete(students):
    pib = str(input("\nВведіть ПІБ студента, якого бажаєте видалити із словника: "))
    if pib in students: # якщо заданий учень є в словнику
        del students[pib]
        print(f"Інформацію про {pib} успішно видалено!")
    else: # якщо заданого учня немає є в словнику
        print(f"Дані про {pib} відсутні!")

# функція друку всього словника
def print_students(students):
    for pib, data in students.items():
        print(f"\n{pib}:\nАдреса: {data['адреса']};\nНомер школи: {data['номер школи']};\nКлас: {data['клас']}.")

# функція сортування та виведення копії словника
def sort_students(students):
    students = {k: students[k] for k in sorted(students)}
    print("\nВідсортований словник:")
    print_students(students)

# функція пошуку учнів які навчаються у визначеній школі та в 10-11 класах
def student_search(students, school_number):
    students_list = []
    for pib, data in students.items():
        if data["номер школи"] == school_number and data["клас"] in (10, 11):
            students_list.append((pib, data["адреса"], data["клас"]))
    if len(students_list) == 0:
        print(f"\nУ школі №{school_number} немає учнів 10-11 класів.")
    else:
        print(f"\nУчні школи №{school_number}, що навчаються у старших класах:")
        for pib, address, clas in students_list:
            print(f"\n{pib}:\nКлас: {clas};\nАдреса: {address}.")

# головна функція програми
def main():
    # створення словника із 10 записів
    students = \
    {
        "Нестеренко Олександр Олександрович":
        {
            "адреса": "вул. Шевченка, 10",
            "номер школи": 3,
            "клас": 8
        },
        "Остапенко Вадим Миколайович":
            {
                "адреса": "вул. Миру, 8",
                "номер школи": 5,
                "клас": 10
            },
        "Орехов Іван Васильович":
            {
                "адреса": "вул. Центральна, 13",
                "номер школи": 4,
                "клас": 9
            },
        "Ганжара Богдан Сергійович":
            {
                "адреса": "вул. Грушевського, 58",
                "номер школи": 5,
                "клас": 11
            },
        "Пушкар Юлія Сергіївна":
            {
                "адреса": "вул. Перемоги, 31",
                "номер школи": 3,
                "клас": 10
            },
        "Тахтай Назар Володимирович":
            {
                "адреса": "вул. Квіткова, 4",
                "номер школи": 4,
                "клас": 11
            },
        "Писала Ольга Володимирівна":
            {
                "адреса": "вул. Лесі Українки, 19",
                "номер школи": 4,
                "клас": 8
            },
        "Снаговська Дар'я Сергіївна":
            {
                "адреса": "вул. Степана Бандери, 21",
                "номер школи": 3,
                "клас": 11
            },
        "Левадний Яків Валентинович":
            {
                "адреса": "вул. Шевченка, 44",
                "номер школи": 5,
                "клас": 7
            },
        "Горбась Володимир Володимирович":
            {
                "адреса": "вул. Грушевського, 13",
                "номер школи": 4,
                "клас": 10
            }
    }

    print("Інструкція по використанню програми:")

    while True: # цикл виконується поки користувач не натисне 0
        # інструкція по програмі
        print("\n0 - вихід з програми")
        print("1 - додати новий запис до словника")
        print("2 - видалити запис із словника")
        print("3 - вивести на екран всі значення словника")
        print("4 - сортувати словник по прізвищу за алфавітним порядком")
        print("5 - визначити ПІБ та адреси учнів, що навчаються у визначеній школі в старших класах(10-11 класи)\n")

        # введення користувачем обраної функції програми
        choice = int(input("Введіть Ваш вибір: "))
        while choice < 0 or choice > 6: # якщо користувач ввів неправильно
            choice = int(input("Помилка при введенні, спробуйте знову: "))

        if choice == 0: # якщо ввів 0
            print("Програму завершено")
            break

        elif choice == 1: # якщо ввів 1
            print("\nВведіть дані про нового учня")
            pib = str(input("Введіть ПІБ учня: "))
            address = str(input("Введіть адресу: "))
            school_number = int(input("Введіть номер школи: "))
            clas = int(input("Введіть клас: "))
            add_dict(students, pib, address, school_number, clas)
            print("До словника було додано новий запис!")

        elif choice == 2: # якщо ввів 2
            delete(students)

        elif choice == 3: # якщо ввів 3
            print_students(students)

        elif choice == 4: # якщо ввів 4
            sort_students(students)

        elif choice == 5: # якщо ввів 5
            school_number = int(input("Введіть номер школи: "))
            student_search(students, school_number)

main() # виклик головної функції програми
