from math import sin, radians # імпортуємо функцію sin та radians

def expression (a, b): # функція для обчислення виразу
    a = radians(a) # переведення градусів у радіани, так як sin працює лише з радіанами
    b = radians(b) # переведення градусів у радіани, так як sin працює лише з радіанами
    return sin(a + b) * sin(a - b) # обчислює та повертає результат

def distance(M, K): # функція для обчислення к-сті днів
    count = 1 # лічильник
    while M <= 50: # поки не перевищить 50 км
        M += M * K / 100 # збільшуємо норму пробігу на K%
        count += 1 # збільшуємо лічильник
    return count # повертаємо результат

a = float(input("Введіть значення a (у градусах): ")) # введення а
b = float(input("Введіть значення b (у градусах): ")) # введення b

print("Значення z = ", round(expression (a, b), 2)) # виведення результату обчислень

M = float(input("Введіть M (скільки км пробігає спортсмен за 1-й день): ")) # введення M
while (M <= 0): # якщо M введенно не вірно
    print("ПОМИЛКА: M повинно бути додатним") # повідомлення про помилку
    M = float(input("Введіть M (скільки км пробігає спортсмен за 1-й день): ")) # вводимо M знову

K = float(input("Введіть K (наскільки % спортсмен збільшує норму пробігу): ")) # введення K
while (K <= 0): # якщо K введенно не вірно
    print("ПОМИЛКА: K повинно бути додатним") # повідомлення про помилку
    K = float(input("Введіть K (наскільки % спортсмен збільшує норму пробігу): ")) # вводимо K знову

s = distance (M, K) # викликаємо функцію для обрахунку
print("Через", s - 1, "днів норма пробігу стане більше 50 км (на", s, "-й день)") # виведення результатів обчислень