from mod import distance # імпортуємо функцію distance з окремого модуля

M = float(input("Введіть M (скільки км пробігає спортсмен за 1-й день): ")) # введення M
while (M <= 0): # якщо M введенно не вірно
    print("ПОМИЛКА: M повинно бути додатним") # повідомлення про помилку
    M = float(input("Введіть M (скільки км пробігає спортсмен за 1-й день): ")) # вводимо M знову

K = float(input("Введіть K (наскільки % спортсмен збільшує норму пробігу): ")) # введення K
while (K <= 0): # якщо K введенно не вірно
    print("ПОМИЛКА: K повинно бути додатним") # повідомлення про помилку
    K = float(input("Введіть K (наскільки % спортсмен збільшує норму пробігу): ")) # вводимо K знову

s = distance (M, K) # викликаємо функцію для обрахунку
print("Через", s - 1, "днів норма пробігу стане більше 50 км (на", s, "-й день)") # виведення результатів обчислень

