#include <stdio.h> // підключення бібліотеки
#define N 4 // визначення константи

int main() // головна функція програми
{
    int matrix[N][N]; // оголошення двовимірного масиву для матриці
    int sum1 = 0; // введення змінної
    int sum2 = 0; // введення змінної
    printf("vvedit matrytsyu:\n"); // виведення тексту для розуміння що робити користувачу
    for (int i = 0; i < N; i++) // цикл для кожного рядка матриці
    {
        for (int j = 0; j < N; j++) // цикл для кожного елемента у рядку
        {
            printf("[%d],[%d]: ", i, j); // виведення позиції елемента
            scanf_s("%d", &matrix[i][j]); // введення елементів
        }
    }
    // для рядків:
    int magicSum = 0; // введення змінної
    for (int j = 0; j < N; j++) { // умова циклу
        magicSum += matrix[0][j]; // сума першого рядка
    }
    for (int i = 1; i < N; i++) { // початок з другого рядка
        int magicSum2 = 0; // введення змінної
        for (int j = 0; j < N; j++) { // умова циклу
            magicSum2 += matrix[i][j]; // сума рядка
        }
        if (magicSum2 != magicSum) { // якщо сума будь-якого рядка не співпадає з сумою першого
            printf("Matrytsya ne ye mahichnym kvadratom\n"); // виведення відповідного повідомлення
            return 0; // завершення, бо матриця не є магічною
        }
    }
    // для стовпців:
    for (int j = 0; j < N; j++) { // умова циклу 
        int colSum = 0; // введення змінної для обчислення суми стовпчика
        for (int i = 0; i < N; i++) { // для кожного елемента стовпця
            colSum += matrix[i][j]; // сума стовпця
        }
        if (colSum != magicSum) { // якщо сума стовпчика не = сумі рядка
            printf("Matrytsya ne ye mahichnym kvadratom\n"); // виведення відповідного повідомлення
            return 0; // завершення програми, бо матриця не є магічною
        }
    }
    // для головної діагоналі:
    int diag1Sum = 0; // введення змінної для суми головної діагоналі
    for (int i = 0; i < N; i++) { // умова циклу
        diag1Sum += matrix[i][i]; // сума елементів діагоналі
    }
    if (diag1Sum != magicSum) { // якщо сума головної діагоналі не = з сумі рядка
        printf("Matrytsya ne ye mahichnym kvadratom\n"); // виведення відповідного повідомлення
        return 0; // завершення програми, бо матриця не є магічною
    }
    // перевірка другої діагоналі
    int diag2Sum = 0; // введення змінної для суми другої діагоналі
    for (int i = 0; i < N; i++) { // умова циклу
        diag2Sum += matrix[i][N - i - 1]; // сума елементів другої діагоналі
    }
    if (diag2Sum != magicSum) { // якщо сума другої діагоналі не = сумі рядка
        printf("Matrytsya ne ye mahichnym kvadratom\n"); // виведення відповідного повідомлення
        return 0; // завершення програми, бо матриця не є магічною
    }
    printf("Matrytsya ye mahichnym kvadratom\n"); // виведення результату, якщо всі перевірки пройдені
    return 0; // завершення програми
}

